# 3. Напишите программу, в которой пользователь будет задавать две строки,
# программа - определять количество вхождений одной строки в другой.

a = input("введите строку 1: ")
b = input("введите строку 2: ")
print (a.count(b))